/**
  *************************************************************************************************************************
  * @file    led.c
  * @author  amkl
  * @version V1.0
  * @date    2022-09-22
  * @brief   led模块.c文件配置
  *************************************************************************************************************************
  * @attention
  *
  *************************************************************************************************************************
  */

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "led.h"
/* 定义 -----------------------------------------------------------------------------------------------------------------*/


/**
 * 函数名:LED_GPIO_Config
 * 描述:led模块对应的gpio配置
 * 输入:无
 * 输出:无
 */
void LED_GPIO_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStruture;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	
	GPIO_InitStruture.GPIO_Pin=GPIO_Pin_3|GPIO_Pin_4|GPIO_Pin_5;
	GPIO_InitStruture.GPIO_Mode=GPIO_Mode_Out_PP;
	GPIO_InitStruture.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_Init(GPIOB,&GPIO_InitStruture);
	
	LED_RED=LED_GREEN=LED_YELLOW=0;
}

/*****************************************************END OF FILE*********************************************************/	
